DataProcessors/ЗадолженостьУправлениеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ЗадолженостьУправлениеТруда</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogObject.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>COD</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CDPR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NCARD</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDPIL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PASPPIL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FIOPIL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>INDEX</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CDUL</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HOUSE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BUILD</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>APT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>KAT</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LGCODE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DATEIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DATEOUT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MONTHZV</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>YEARZV</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RAH</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MONEY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EBK</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SUM_BORG</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЗадолженостьУправлениеТруда/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьЗадолженностьНаСервере()
	тзСписок = Объект.ТабличнаяЧасть.Выгрузить();
	Для Каждого стр Из тзСписок Цикл
		Задолженность = ОпределитьЗадолженность(Справочники.ЛицевыеСчета.НайтиПоНаименованию(СтрЗаменить(Строка(стр.RAH), Символы.НПП, "")), стр.LGCODE);
		стр.SUM_BORG = Задолженность;
	КонецЦикла;
	Объект.ТабличнаяЧасть.Загрузить(тзСписок);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗадолженность(Команда)
	СформироватьЗадолженностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Файл XBase (*.dbf)|*.dbf'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "dbf";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
	    Объект.Файл = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	Таб = Новый XBase;
	Таб.ОткрытьФайл(Объект.Файл,,Истина);
	Таб.Первая();
	Таб.Кодировка = КодировкаXBase.OEM;
	Объект.ТабличнаяЧасть.Очистить();
	Пока Не Таб.ВКонце() Цикл
		НоваяСтрока                   = Объект.ТабличнаяЧасть.Добавить();
		НоваяСтрока.COD               = Таб.COD;
		НоваяСтрока.CDPR              = Таб.CDPR;
		НоваяСтрока.NCARD             = Таб.NCARD;
		НоваяСтрока.IDPIL             = Таб.IDPIL;
		НоваяСтрока.PASPPIL           = Таб.PASPPIL;
		НоваяСтрока.FIOPIL            = Таб.FIOPIL;
		НоваяСтрока.INDEX             = Таб.INDEX;
		НоваяСтрока.CDUL              = Таб.CDUL;
		НоваяСтрока.HOUSE             = Таб.HOUSE;
		НоваяСтрока.BUILD             = Таб.BUILD;
		НоваяСтрока.APT               = Таб.APT;
		НоваяСтрока.KAT               = Таб.KAT;
		НоваяСтрока.LGCODE            = Таб.LGCODE;
		НоваяСтрока.DATEIN            = Таб.DATEIN;
		НоваяСтрока.DATEOUT           = Таб.DATEOUT;
		НоваяСтрока.MONTHZV           = Таб.MONTHZV;
		НоваяСтрока.YEARZV            = Таб.YEARZV;
		НоваяСтрока.RAH               = Таб.RAH;
		НоваяСтрока.MONEY             = Таб.MONEY;
		НоваяСтрока.EBK               = Таб.EBK;
		НоваяСтрока.SUM_BORG          = Таб.SUM_BORG;
		Таб.Следующая();
	КонецЦикла;
	Таб.ЗакрытьФайл();
КонецПроцедуры

&НаСервере
Функция ОпределитьЗадолженность(ЛицевойСчет, Услуга)
	
	Если Услуга = 502 Тогда
		Сумма = ОбщийМодульМВК.ПолучитьОстатки(Объект.НаДату, ЛицевойСчет, Справочники.ВидыУслуг.ХолоднаяВода);
		Возврат Сумма;
		//Условие = " И ЛицевойСчет = &ЛицевойСчет И Услуга.ВидУслуги = &ВидУслуги";
		//Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		//Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.ХолоднаяВода);
	КонецЕсли;
	Если Услуга = 507 Тогда
		Сумма = ОбщийМодульМВК.ПолучитьОстатки(Объект.НаДату, ЛицевойСчет, Справочники.ВидыУслуг.Водоотведение);
		Возврат Сумма;
		//Условие = " И ЛицевойСчет = &ЛицевойСчет И Услуга.ВидУслуги = &ВидУслуги";
		//Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		//Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.Водоотведение);
	КонецЕсли;
КонецФункции

&НаСервере
Функция ОпределитьЗадолженность1(ЛицевойСчет, Услуга)
	Запрос = Новый Запрос;
	Если Услуга = 502 Тогда
		Условие = " И ЛицевойСчет = &ЛицевойСчет И Услуга.ВидУслуги = &ВидУслуги";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.ХолоднаяВода);
	КонецЕсли;
	Если Услуга = 507 Тогда
		Условие = " И ЛицевойСчет = &ЛицевойСчет И Услуга.ВидУслуги = &ВидУслуги";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.Водоотведение);
	КонецЕсли;
	
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(ВложенныйЗапрос.НачальныйОстаток) КАК НачальныйОстаток,
	    |	СУММА(ВложенныйЗапрос.Начислено) КАК Начислено,
	    |	СУММА(ВложенныйЗапрос.Оплачено) КАК Оплачено,
	    |	СУММА(ВложенныйЗапрос.Льгота) КАК Льгота,
	    |	СУММА(ВложенныйЗапрос.Субсидия) КАК Субсидия,
	    |	СУММА(ВложенныйЗапрос.Перерасчет) КАК Перерасчет
	    |ИЗ
	    |	(ВЫБРАТЬ
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК Начислено,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход КАК Оплачено,
	    |		0 КАК Льгота,
	    |		0 КАК Субсидия,
	    |		0 КАК Перерасчет
	    |	ИЗ
	    |		РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Авто, , ЛицевойСчет.ПометкаУдаления = ЛОЖЬ" + Условие + ") КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		0,
	    |		0,
	    |		0,
	    |		СУММА(ВЫБОР
	    |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	    |					ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |				ИНАЧЕ 0
	    |			КОНЕЦ),
	    |		СУММА(ВЫБОР
	    |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	    |					ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |				ИНАЧЕ 0
	    |			КОНЕЦ),
	    |		СУММА(ВЫБОР
	    |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	    |						ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
	    |					ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |				ИНАЧЕ 0
	    |			КОНЕЦ)
	    |	ИЗ
	    |		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |	ГДЕ
	    |		РасчетыПоЛицевымСчетам.ЛицевойСчет.ПометкаУдаления = ЛОЖЬ" + Условие + "
	    |		И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания) КАК ВложенныйЗапрос";
	Запрос.УстановитьПараметр("ДатаНачала", '20200501000000');
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.НаДату));
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Данные = Новый Структура;
	Пока РезультатЗапроса.Следующий() Цикл
		Данные.Вставить("НачальныйОстаток", РезультатЗапроса.НачальныйОстаток);
		Данные.Вставить("Начислено", РезультатЗапроса.Начислено);
		Данные.Вставить("Оплачено", РезультатЗапроса.Оплачено);
		Данные.Вставить("Льгота", РезультатЗапроса.Льгота);
		Данные.Вставить("Субсидия", РезультатЗапроса.Субсидия);
		Данные.Вставить("Перерасчет", РезультатЗапроса.Перерасчет);
	КонецЦикла;
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	Файл = Новый XBase;
	Файл.Кодировка = КодировкаXBase.OEM;
	Файл.поля.Добавить("COD", "N", 4, 0);
	Файл.поля.Добавить("CDPR", "N", 12, 0);
	Файл.поля.Добавить("NCARD", "N", 10, 0);
	Файл.поля.Добавить("IDPIL", "C", 10, 0);
	Файл.поля.Добавить("PASPPIL", "C", 14, 0);
	Файл.поля.Добавить("FIOPIL", "C", 50, 0);
	Файл.поля.Добавить("INDEX", "N", 6, 0);
	Файл.поля.Добавить("CDUL", "N", 5, 0);
	Файл.поля.Добавить("HOUSE", "C", 7, 0);
	Файл.поля.Добавить("BUILD", "C", 2, 0);
	Файл.поля.Добавить("APT", "C", 4, 0);
	Файл.поля.Добавить("KAT", "N", 4, 0);
	Файл.поля.Добавить("LGCODE", "N", 4, 0);
	Файл.поля.Добавить("DATEIN", "C", 10, 0);
	Файл.поля.Добавить("DATEOUT", "C", 10, 0);
	Файл.поля.Добавить("MonthZv", "N", 2, 0);
	Файл.поля.Добавить("YearZv", "N", 4, 0);
	Файл.поля.Добавить("RAH", "C", 25, 0);
	Файл.поля.Добавить("MONEY", "N", 1, 0);
	Файл.поля.Добавить("EBK", "C", 10, 0);
	Файл.поля.Добавить("Sum_Borg", "N", 9, 2);
	Попытка
		Файл.СоздатьФайл(Объект.Файл);
	Исключение
		Предупреждение("Помилка створення файлу " + Файл);
		Возврат;
	КонецПопытки;
	Для Каждого стр Из Объект.ТабличнаяЧасть Цикл
		Файл.Добавить();
		Файл.COD = стр.COD;
		Файл.CDPR = стр.CDPR;
		Файл.NCARD = стр.NCARD;
		Файл.IDPIL = стр.IDPIL;
		Файл.PASPPIL = стр.PASPPIL;
		Файл.FIOPIL = стр.FIOPIL;
		Файл.INDEX = стр.INDEX;
		Файл.CDUL = стр.CDUL;
		Файл.HOUSE = стр.HOUSE;
		Файл.BUILD = стр.BUILD;
		Файл.APT = стр.APT;
		Файл.KAT = стр.KAT;
		Файл.LGCODE = стр.LGCODE;
		Файл.DATEIN = стр.DATEIN;
		Файл.DATEOUT = стр.DATEOUT;
		Файл.MonthZv = стр.MonthZv;
		Файл.YearZv = стр.YearZv;
		Файл.RAH = стр.RAH;
		Файл.MONEY = стр.MONEY;
		Файл.EBK = стр.EBK;
		Файл.Sum_Borg = стр.Sum_Borg;
		Файл.Записать();
	КонецЦикла;
	Файл.ЗакрытьФайл();
КонецПроцедуры
